package chapter06.EX01;

public class Using_Class01 {

	public static void main(String[] args) {
		//절차지향 프로그램 : C언어, 시간의 순서에 따라서 프로그래밍 하는 방식
			//람보르기니 : 한 공장에서 모든(타이어,유리등등) 제품을 완성
			// 고장시 생산된 공장에서만 수리가능, 제품을 모두 분해해서 다시 제작
		
		//객체지향 프로그램(OOP) : Java, 프로그램 객체, 객체, 객체
			//일반자동차 : 자동차의 부품을 표준화해서, 타이어 ,유리,엔진등 객체 객체 화
			// 객체를조립하는 형식으로 제품을 완료한다
				//개발하기 쉽다, 수리하기도쉽다
		
		
		//1. 클래스 내부의 요소들
			// 필드
			// 생성자
			// 메소드
			// 이너클래스 (내부클래스)
		//2. 클래스 외부의 요소들
			// 패키지
			// 임포트
			// 외부 클래스
		 				

	}

}
